MY PROJECTS  -*- mode: org; fill-column: 78 -*-

* Org-Fixes
  - [[https://stackoverflow.com/a/48389250][Category markers on Agenda View]]
* [[http://newartisans.com/2007/08/using-org-mode-as-a-day-planner/][Planning with Org Mode]]
** Step 1: Creation
   - Just create tasks, don't worry about scheduling
   - use C-cc to open the capture

** Step 2: Filing tasks
   - Schedule when I want to do tasks
   - USE C-c C-x C-s to move file to archive
   - Use C-c C-s to schedule
   - Specify "+7" if I don't know when to schedule
   - DEFERRED tasks have no scheduled time yet
** Step 3: Breifly review upcoming week
   - Jump to agenda view (C-c a a)
   - C-c C-s to reschedule
   - press "r" in agenda view to refresh the display
   - press "q" to quitA
   - press "." to go to current day
   - press "d" to switch to daily view for selected day
** Step 4: Getting ready for the day
   - Org mode automatically reshedules overdue tasks with "Sched 2x ..."
   - use the "," to set task priorities "space" to remove the priorities
** Step 5: Doing the work
   - 
** Step 6: Moving on to the next step
** Step 7: Archiving tasks
   - C-c C-x C-s
   - C-c a c will open all agenda files with "DONE" state for archiving
   - C-c [ will do somehting to fix agenda view when TODO's aren't showing
   - in bash run "*.org_archive >> archive; rm *.org_archive" to append and remove archive files

* Clocking
  - C-c C-x C-i Clock into a task
  - C-c C-x C-o Clock out of a task
  - View clocked times C-c C-x C-c (q to exit)

* Tasks
:PROPERTIES:
:CATEGORY: Tasks
:END: 
** WAITING Email Megan Rock (FHE)
   SCHEDULED: <2018-11-29 Thu>
   - State "WAITING"    from "WAITING"    [2018-11-26 Mon 13:24] \\
	 Calling on Thursday. Take notes of anything extranneous
   - State "WAITING"    from "WAITING"    [2018-11-19 Mon 15:34] \\
	 Set up time to meet on wednesday. Going to finalize some things
   - State "WAITING"    from "TODO"       [2018-11-13 Tue 09:34] \\
	 Emailed with Rachel. Waiting for response
** DONE Emails Catch up
   SCHEDULED: <2018-11-12 Mon ++1w>
 
   - State "DONE"       from "TODO"       [2018-11-12 Mon 16:51]
  [[file:~/.emacs.d/Notebooks/scratch][file:~/.emacs.d/Notebooks/scratch]]
* School
:PROPERTIES:
:CATEGORY: School
:END: 
** WAITING [#C] Research for cs230 - Proprietary BackDoors
   SCHEDULED: <2018-11-15 Thu>
   - State "WAITING"    from "TODO"       [2018-11-12 Mon 15:40] \\
	 Added some links. Waiting for my partners to work on it as well. I will work on it again tomorrow
   - [[https://www.gnu.org/proprietary/proprietary-back-doors.en.html][Backdoors]]
** WAITING [#A] ECE330/L - [[https://blackboard.boisestate.edu/bbcswebdav/pid-5576738-dt-content-rid-28417450_1/courses/1189-72216ECE330L003/ECE330_S18_Lab12_Prelab%281%29.pdf][Final Prelab]]
   DEADLINE: <2018-12-05 Wed> SCHEDULED: <2018-11-28 Wed>
   - State "WAITING"    from "INPROGRESS" [2018-11-13 Tue 23:37] \\
	 Going to ask Tyler F. for some help on final question. Then this needs to be submitted
   :LOGBOOK:
   CLOCK: [2018-11-13 Tue 22:41]--[2018-11-13 Tue 23:37] =>  0:56
   :END:
** SUBMITTED MATH307 - [[https://blackboard.boisestate.edu/bbcswebdav/pid-5929199-dt-content-rid-30162008_1/courses/1189-70632MATH307001/Assignment%20_9.pdf][Assignment]] 9 (EL Gamal Signatures) 
   SCHEDULED: <2018-11-15 Thu> DEADLINE: <2018-11-15 Thu>
   - State "SUBMITTED"  from "STARTED"    [2018-11-15 Thu 09:36]
   - State "STARTED"    from "WAITING"    [2018-11-15 Thu 09:35] \\
	 Finished part1.txt and part2.sage for homework 9. Need to print off
   - State "WAITING"    from "INPROGRESS" [2018-11-15 Thu 00:43] \\
	 Rescheduled for class on Thursday. I figured out the solution to the final part of the homework. I just need to pretty up the assignment for submission tomorrow. Will do that in class.
   :LOGBOOK:
   CLOCK: [2018-11-15 Thu 09:35]--[2018-11-15 Thu 09:35] =>  0:00
   CLOCK: [2018-11-15 Thu 00:07]--[2018-11-15 Thu 00:43] =>  0:36
   :END:
   - State "WAITING"    from "STARTED"    [2018-11-13 Tue 15:46] \\
	 Got a huge lead on the assignment. I will meet up wiith Ian tomorrow to review it and complete it
   - State "STARTED"    from "TODO"       [2018-11-13 Tue 09:34] \\
	 Starting assignment 9
** TODO [#A] CS253 Schedule Time to take final exam
   SCHEDULED: <2018-11-26 Mon> DEADLINE: <2018-11-26 Mon>
 
  [[file:~/.emacs.d/Notebooks/todo.org::*School][School]]
** TODO Final Math307Quiz 3
   SCHEDULED: <2018-11-29 Thu>
 
  [[file:~/.emacs.d/Notebooks/Fall2018.org::El%20Gamal%20Security][El Gamal Security]]
** TODO Math307 Final Exam
   SCHEDULED: <2018-12-06 Thu> DEADLINE: <2018-12-13 Thu 10:30>
 
  [[file:~/.emacs.d/Notebooks/Fall2018.org::El%20Gamal%20Security][El Gamal Security]]
** TODO Math307 Key Submission for Final Exam
   SCHEDULED: <2018-11-27 Tue> DEADLINE: <2018-12-04 Tue>
 
  [[file:~/.emacs.d/Notebooks/Fall2018.org::El%20Gamal%20Security][El Gamal Security]]
** INPROGRESS Homework 10 - Legendre Function?
   SCHEDULED: <2018-11-26 Mon> DEADLINE: <2018-11-27 Tue>
 
  [[file:~/.emacs.d/Notebooks/Fall2018.org::*Homework%209][Homework 9]]
** INPROGRESS Follow up with Graduate application (see emails)
   SCHEDULED: <2018-11-28 Wed>
 
  [[file:~/.emacs.d/Notebooks/todo.org::*Health][Health]]
** WAITING [[file:~/.emacs.d/Notebooks/todo.org::*Apply%20to%20'Age%20of%20Aincrad'%20-%20see%20tyler's%20messenger%20comments][Apply to 'Age of Aincrad' - see tyler's messenger comments]]
   - State "WAITING"    from "TODO"       [2018-11-26 Mon 13:25] \\
	 Submitted Resume. Waiting for response
** TODO ECE 330 Homework
   SCHEDULED: <2018-11-26 Mon> DEADLINE: <2018-11-27 Tue>
** TODO MATH307 Homework 10 Finish
   DEADLINE: <2018-11-27 Tue> SCHEDULED: <2018-11-26 Mon>
 
  [[file:~/.emacs.d/Notebooks/todo.org::*Clocking][Clocking]]
** TODO Drop UF200 til following semester? Reduce total number of credits?
 
  [[file:~/.emacs.d/Notebooks/Fall2018.org::*Consult%20Advisor%20to%20finalize%20Spring%20schedule][Consult Advisor to finalize Spring schedule]]
* Work
:PROPERTIES:
:CATEGORY: Work
:END:
** TODO [#C] Schedule Time to Observe another LA
   SCHEDULED: <2018-11-26 Mon> DEADLINE: <2018-11-21 Wed>

** DONE [#A] Apply to Xylem internship. Like MDU, looks like a good opportunity. I think I have the necessary skill set for this internship. Give it a shot!
   SCHEDULED: <2018-11-21 Wed>
   - State "DONE"       from "TODO"       [2018-11-21 Wed 13:58]
*** [[https://jobs.jobvite.com/xylem/job/oWeA8fwC/apply][Xylem - application]]
** TODO test


 [[file:~/.emacs.d/Notebooks/todo.org::*ECE330%20take%20quiz%20over%20break][ECE330 take quiz over break]]
** TODO Apply to scentsy/Check on applicatoin
   SCHEDULED: <2018-11-30 Fri>

 [[file:~/.emacs.d/Notebooks/Fall2018.org::*Check%20LA%20availability%20for%20next%20semester,%20notify%20Kate%20of%20any%20major%20changes][Check LA availability for next semester, notify Kate of any major changes]]
* Health
:PROPERTIES:
:CATEGORY: Health
:END:
* Finances
 :PROPERTIES:
:CATEGORY: Finances
:END: 
** TODO Tution and Fees due ($3,947)
   SCHEDULED: <2019-01-04 Fri> DEADLINE: <2019-01-10 Thu>
* Miscellaneous
:PROPERTIES:
:CATEGORY: Misc
:END:
** TODO [#C] [[http://cachestocaches.com/2017/3/complete-guide-email-emacs-using-mu-and-/][Integrate Gmail with Emacs]]
*** [[http://pragmaticemacs.com/emacs/master-your-inbox-with-mu4e-and-org-mode/][Here is another resource]]
** TODO [#B] Backup Windows Files

 [[file:~/.emacs.d/Notebooks/todo.org::*Step%207:%20Archiving%20tasks][Step 7: Archiving tasks]]
** TODO [#B] Order new personal card from MACU
* STARTUP
#+STARTUP: content
#+STARTUP: lognotestate
* Ideas
**  Allowance App - Simulate what I keep on a post-it note already     :IDEA: 
   :LOGBOOK:
   CLOCK: [2018-11-19 Mon 15:37]--[2018-11-19 Mon 15:37] =>  0:00
   :END:
 <2018-11-19 Mon>

* Church
:PROPERTIES:
:CATEGORY: Tasks
:END: 
** TODO [#A] Contact Ministering Families and companion
   SCHEDULED: <2018-12-01 Sat>

 [[file:~/.emacs.d/Notebooks/todo.org::*Health][Health]]
